nxp-mcuxpresso/mcux-soc-svd/MCXN527T/MCXN527T_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CACHE64_POLSEL0</name>
      <description>CACHE64_POLSEL</description>
      <alternatePeripheral>CACHE64_CTRL0</alternatePeripheral>
      <groupName>CACHE64_POLSEL</groupName>
      <baseAddress>0x4001B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG0_TOP</name>
          <description>Region 0 Top Boundary</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAA800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_TOP</name>
              <description>Upper Limit Of Region 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG1_TOP</name>
          <description>Region 1 Top Boundary</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x15555400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG1_TOP</name>
              <description>Upper Limit Of Region 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POLSEL</name>
          <description>Policy Select</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_POLICY</name>
              <description>Policy Select For Region 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG0_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_POLICY</name>
              <description>Policy Select For Region 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG1_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_POLICY</name>
              <description>Policy Select For Region 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG2_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I3C0</name>
      <description>I3C</description>
      <groupName>I3C</groupName>
      <headerStructName>I3C</headerStructName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I3C0</name>
        <value>95</value>
      </interrupt>
      <registers>
        <register>
          <name>MCONFIG</name>
          <description>Controller Configuration</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSTENA</name>
              <description>Controller Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASTER_OFF</name>
                  <description>CONTROLLER_OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_ON</name>
                  <description>CONTROLLER_ON</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_CAPABLE</name>
                  <description>CONTROLLER_CAPABLE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MASTER_MODE</name>
                  <description>I2C_CONTROLLER_MODE</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISTO</name>
              <description>Disable Timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled, if configured</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HKEEP</name>
              <description>High-Keeper</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIRED_IN</name>
                  <description>WIRED_IN</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASSIVE_SDA</name>
                  <description>PASSIVE_SDA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASSIVE_ON_SDA_SCL</name>
                  <description>PASSIVE_ON_SDA_SCL</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODSTOP</name>
              <description>Open Drain Stop</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPBAUD</name>
              <description>Push-Pull Baud Rate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPLOW</name>
              <description>Push-Pull Low</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODBAUD</name>
              <description>Open Drain Baud Rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODHPP</name>
              <description>Open Drain High Push-Pull</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKEW</name>
              <description>Skew</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2CBAUD</name>
              <description>I2C Baud Rate</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCONFIG</name>
          <description>Target Configuration</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLVENA</name>
              <description>Target Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NACK</name>
              <description>Not Acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Always disable NACK mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Always enable NACK mode (works normally)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MATCHSS</name>
              <description>Match Start or Stop</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0IGNORE</name>
              <description>Ignore TE0 or TE1 Errors</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Do not ignore TE0 or TE1 errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Ignore TE0 or TE1 errors</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDROK</name>
              <description>Double Data Rate OK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Do not allow HDR-DDR messaging</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Allow HDR-DDR messaging</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDRAND</name>
              <description>ID random</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Part number and an instance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Random value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFLINE</name>
              <description>Offline</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BAMATCH</name>
              <description>Bus Available Match</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR</name>
              <description>Static Address</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
